//
//  KIkbsDataManager.swift
//  KIkbsKeyBoard
//
//  Created by JOJO on 2021/8/26.
//

import UIKit


enum SpecialStrType {
    case symbol
    case quote
    case emojiStr
    case shape
}

struct SpecialStrBundle: Codable {
    var titleName: String
    var specialStrList: [String]
    var isPro: Bool = false
    
}

struct TextCardThemeColor: Codable {
    var bgColor: String
    var normalTextColor: String
    var hilightTextColors: [String]
    
    
}

struct TextCardThemeFontItem {
    var contentStr_low = ""
    var contentStr_up = ""
}

struct TextCardThemeOverlayerItem: Codable {
    var thumb = ""
    var big = ""
}

// push favorite fetch noti
let noti_favoriteFetch = "noti_favoriteFetch"


class KIkbsDataManager: NSObject {
    static let `default` = KIkbsDataManager()
    var specialSymbolList : [SpecialStrBundle] {
        return KIkbsDataManager.default.loadJson([SpecialStrBundle].self, name: "specialSymbolList") ?? []
    }
    
    var specialQuoteList: [SpecialStrBundle] {
        return KIkbsDataManager.default.loadJson([SpecialStrBundle].self, name: "specialQuoteList") ?? []
    }
    
    var specialEmojiStrList: [SpecialStrBundle] {
        return KIkbsDataManager.default.loadJson([SpecialStrBundle].self, name: "specialEmojiStrList") ?? []
    }
    
    var specialShapeList: [SpecialStrBundle] = []
    
    var textCardThemeColorList: [TextCardThemeColor] {
        
        return KIkbsDataManager.default.loadJson([TextCardThemeColor].self, name: "textCardThemeColor") ?? []
    }
    
    var textCardThemeOverlayerList: [TextCardThemeOverlayerItem] {
        return KIkbsDataManager.default.loadJson([TextCardThemeOverlayerItem].self, name: "textCardOverlayerImg") ?? []
    }
    
    var textCardThemeNormalFontList: [String] = []
    var textCardThemeHilightFontList: [String] = []
    
    
    
    override init() {
        super.init()
        loadData()
    }
    
    func loadData() {
        
        let shape1Bundle = SpecialStrBundle.init(titleName: "Cute", specialStrList: komojiArray, isPro: false)
        let shape2Bundle = SpecialStrBundle.init(titleName: "Cartoon", specialStrList: komoji2Array, isPro: false)
        let shape3Bundle = SpecialStrBundle.init(titleName: "Happy", specialStrList: komoji3Array, isPro: true)
        let shape4Bundle = SpecialStrBundle.init(titleName: "Shape", specialStrList: komoji4Array, isPro: true)
        specialShapeList = [shape1Bundle, shape2Bundle, shape3Bundle, shape4Bundle]
        textCardThemeNormalFontList = [Font_Avenir_Heavy, Font_AvenirNext_Medium]
        textCardThemeHilightFontList = ["KohinoorGujarati-Bold", "Menlo-Regular", "MyanmarSangamMN-Bold", "NotoSansMyanmar-Regular", "NotoSansOriya-Bold"]
        
        
    }
    
    func randomQuoteStr() -> String {
        let quoteList: [String] = ["♡˗ˏ✎*ೃ˚ :cherries: :;",
                                   "Hello🌷 dear so nice looking u🥰",
                                   "ヽ｀、☁ヽ｀𝐝𝐨𝐧’𝐭 𝐮𝐧𝐟𝐨𝐥𝐥𝐨𝐰 𝐦𝐞 ☂˚｡",
                                   "☄. *. ⋆You are mind-blowing🍓",
                                   "(▰˘◡˘▰)🌻⋆˙⊹Cutiepie",
                                   "˚₊· ͟͟͞͞➳❥ That innocent look tho💐༶⋆˙",
                                   "✰ Aren’t you awesome?☁✎✉",
                                   "Anytime 🤟",
                                   "⇒ love to flying 𓅮 ⁄⁄ 🧚♀ °",
                                   "__ . before u go😍",
                                   " ʕ•ᴥ•ʔ Cutiepie 💖",
                                   "🧚🏻‍♀️You look super cute!🤩",
                                   "Million-dollar smile! ✨❤️",
                                   "👫Friends forever🔥",
                                   "👁 Watch out, world🌏",
                                   "Hey(*^▽^*)👻",
                                   "💥Soo pretty❤️",
                                   "😱Good shoot✨",
                                   "✨Cuteness overloaded❗️❗️",
                                   "🎉Hello sunshine☀️ ",
                                   "❇️Wow😱",
                                   "You’re 🥳Stunning!👏",
                                   "⭐️ Can’t scroll…(✖ ✖)",
                                   "📸Awesome pic💋",
                                   "Love💖  love💕 love❤️",
                                   "💜Bae this one❗️",
                                   "🌸Proper patola💓",
                                   "ˏ✎ Simply iconic, I’m in love😘",
                                   "🌈Sooo glamorous🧚🏻‍♀️",
                                   "OMG😱! You fireee🔥",
                                   "📸This is amazing🎉",
                                   "🐻✨Probably the next miss world🌻♡⛓",
                                   "🌷Princess👑",
                                   "Heyaa💖 pretty girl!!💃🏼",
                                   "Wow gorgeous🌸💕",
                                   "🍭Can’t take my eyes off✨…oh gosh💖",
                                   "♀° Cute little bitch⁄⁄ 🧚",
                                   "彡 ★🌌🦋✧☁️✧🦋🌌★ 彡",
                                   "💮🌸💕• ω •🍭💖✨",
                                   "♡🦋✰ Hello ʕ•ᴥ•ʔ✨🌈",
                                   "I've known it from the moment that we met No doubt in my mind where you belong",
                                                        "Cause you make me feel so brand new And I want to spend my life with you",
                                                        "I never loved someone The way that I love you",
                                                        "For a chance to be with you, I'd gladly risk it all",
                                                        "And here we are in heaven For you are mine",
                                                        "Now and then it seems that life is just too much But you've got the love I need to see me through",
                                                        "It's the way that you know what I thought I knew It's the beat that my heart skips when I'm with you",
                                                        "You know I'd never ask you to change If perfect's what you're searching for then just stay the same",
                                                        "Come with me My love To the sea The sea of love",
                                                        "Love can touch us one time And last for a lifetime And never let go 'til we're gone",
                                                        "Two hearts that beat as one Our lives have just begun",
                                                        "And darling I will be loving you 'til we're 70 And baby my heart could still fall as hard at 23",
                                                        "Like a river flows Surely to the sea Darling, so it goes Some things are meant to be",
                                                        "And the wonder of it all Is that you just don't realize how much I love you",
                                                        "Through the clouds I see love shine It keeps me warm as life grows colder",
                                                        "At long last, love has arrived And I thank God I'm alive",
                                                        "Everything means nothing If I ain't got you",
                                                        "Can I go where you go? Can we always be this close forever and ever?",
                                                        "What I got — full stock of thoughts and dreams that scatter And you pull them all together",
                                                        "Honey, I'd walk through fire for you Just let me adore you",
                                                        "Tougher than diamonds and stronger than steel You won't feel nothin' 'til you feel You feel the power, feel the power of love",
                                                        "But something happened for the very first time with you My heart melts into the ground, found something true",
                                                        "Touch me once and you'll know it's true I never wanted anyone like this",
                                                        "I hope you don't mind That I put down in words How wonderful life is while you're in the world",
                                                        "I can't tell one from the other Did I find you, or you find me?",
                                                        "You'll be the prince and I'll be the princess It's a love story, baby, just say, \"Yes\"",
                                                        "With a love like that You know you should be glad",
                                                        "But what it is, though old, so new To fill your heart like no three words could ever do I just called to say I love yo"]
        let str = quoteList.randomElement() ?? ""
        return str
    }
    
    let komojiArray = [
            """
            ｡*☆∴｡　     ｡∴☆*｡
            ｡★*ﾟﾟ*★∵★*ﾟﾟ*★｡
            ☆ﾟ　　  ﾟ☆ﾟ　　   ﾟ☆
            ★*                         *★
            ﾟﾟﾟﾟﾟﾟﾟﾟ☆｡ ♥ LOVE. ♥ ｡☆ﾟ
            *★｡               ｡★*
            ∵☆｡ 　　 ｡☆∵
            ﾟﾟﾟﾟﾟﾟﾟﾟ*★｡ ｡★*ﾟ
            　ﾟ *☆
            """,
            """
            ｡:💖・｡･ﾟ🌸*.ﾟ｡
            ･💠.💜ﾟ.🌼🍏｡:*･.💛
            .ﾟ❤.｡;｡🍓.:*🍇.ﾟ｡🍊｡
            :*｡_💠👝｡_💮*･_ﾟ👛
            ＼ξ　＼　 ζ／
            ∧🎀∧＼ ξ
            （*･ω･ )／
            c/　 つ∀o
            しー-Ｊ おめでとう～🎉
            """,
                    """
                    ☆ *　. 　☆
                    　　        .  ∧＿∧　∩　* ☆
                    * ☆ ( ・∀・)/ .
                    　. ⊂　　  ノ* ☆
                    ☆ * (つ ノ .☆
                    (ノ
                    """,
                    """
                    ▄▄▄▄██〓█●
                    ▂▃▄▅█████▅▄
                    ████████████████
                    ◥⊙▲⊙▲⊙▲⊙▲⊙▲⊙◤
                    　　ヽ(´･ω･)ﾉ
                    """,
            """
            ｡ﾟﾟ･｡･ﾟﾟ｡
            ﾟﾟ。 text here
            　ﾟ･｡･ﾟ
            """,
            """
               🌷🌸🌷🌸
               🌸🌷🌸🌷🌸
             Λ🌷🌸🌷🌸🌷
            ( ˘ ᵕ ˘🌷🌸🌷
             ヽ  つ＼\\   ／
                UU   / 🎀 \\
            """,
                    """
                                       ✦    ⚬         ⚬    ✦
                                     ⚬            ♡            ⚬
                                    ୨୧                        ୨୧
                                     ♡                       ♡
                                        ✦                   ✦
                                            ⚬            ⚬
                                                  ୨୧
                    """,
        """
        ▃▃▃▃▃▃▃▃▃▃▃
        ┊ ┊ ┊ ┊ ┊ ┊
        ┊ ┊ ┊ ┊ ˚✩ ⋆｡˚ ✩
        ┊ ┊ ┊ ✫
        ┊ ┊ ︎✧
        ┊ ┊ ✯
        ┊ . ˚ ˚✩
        """,
        """
        ･ ｡
         🍂∴｡　*
        　･ﾟ*｡🍂･
        　　･ *ﾟ｡　　 *
        　 ･ ﾟ*｡･ﾟ🍃｡
        　　　🌰･｡°*.
        *　　ﾟ｡·*･｡ ﾟ*
        　　　ﾟ *.｡🍁｡🍂　･
        　　* 🍃 ｡･ﾟ*.｡
        　　　 *　🌰 ﾟ･｡ *  ｡
        　　　　･　　ﾟ🍁 ｡
        """,
    ]
    
    let komoji2Array = [
        
        """
        / )))　　　   _
        ／ イ  　　　(((
        (　ﾉ　　　　 ￣Ｙ＼
         |　(＼  ∧＿∧  ｜　)
        ヽ　ヽ`(´･ω･)_／ノ/
        　＼ |　⌒Ｙ⌒　/ /
        　  \\    　  ﾉ／
        　　＼ ﾄー仝ーｲ /
        　　 ｜  ミ土彡 ｜
        　　  )　　　 ｜
        """,
        
        
        """
        ╭﹌☆﹌﹌﹌☆﹌╮
        ∣　　　　　　　∣
        ∣　●　　　●  ∣
        ∣　　　▽　　　∣
        ╰—————--——--╯
          ∣　﹏　﹏　∣
            ╰∪———∪╯
        """,
        """
          ∩ ∩
        （´･ω･）
           ＿|　⊃／(＿＿_
          ／ └-(＿＿＿_／
          ￣￣￣￣￣￣￣
        """,
        """
            ∧ ＿ ∧
        　　(　･∀･)
        　　(　つ┳⊃
         　ε(_)へ⌒ヽﾌ
        　 (　　(　･ω･)
         ≡≡≡　◎―◎ ⊃ ⊃
        """,
        """
        　　　　　　  ∧＿∧
        　　∧＿∧ 　（´<_`︵）
        　（´_ゝ`） 　/　　　ｉ
        　／　　＼　/　　　｜|
        　／　　/￣￣￣￣￣/｜
        ＿(ニっ/　　　　　/　｜＿＿＿＿
        　　＼/＿＿＿＿＿/　(u　 ⊃
        """,
        
        """
              ／￣￣＼
        　　 ／ 　〇・   ＞
        　 ／　 　ε　   │
         ／　　 　〇・  ＞
        (つ＿と＼＿＿／
         ∪　∪
        """,
        """
        ◢████◣
        █＞_＜ █
        ╰——┰——╯
        　┕█┙
        """,
        """
          Λ _ Λ
         (　 ·ω·)
         ( つ 　≡つ
         / __ 　)
         Ｕ ／ Ｕ
        """,
        """
        |―-∩
        |　　ヽ
        |　●　|
        |▼) _ノ
        |￣　)
        (￣ 　／
        T￣|
        """,
        """
           へ　　　　　／|
        　/＼7　　　 ∠＿/
         /　│　　 ／　／
        │　Z ＿,＜　／　　 /`ヽ
        │　　　　　ヽ　　 /　　〉
         Y　　　　　`　 /　　/
        ｲ●　､　●　　⊂⊃〈　　/
        ()　 へ　　　　|　＼〈
        　>ｰ ､_　 ィ　 │ ／／
         / へ　　 /　ﾉ＜| ＼＼
         ヽ_ﾉ　　(_／　 │／／
        　7　　　　　　　|／
        　＞―r￣￣`ｰ―＿／
        """,
        """
                  ∧ ＿ ∧
          ∧ ＿ ∧  (・ω・｡)
        （´・ω ・)  (nnノ)
         （つ　つΓΞΞΞΞΞΞΞΙ
          しーＪ
        """,
        """
          ∩＿＿＿_∩
        |ノ　　　　 ヽ
        |　  ●　　 ● |
        彡　*( _,●_)*ミ
        |   │´・ω・ |│
        | ＿ ￣￣￣    _|
        | ∪　　　　 ∪
        ＼__　　 　 _/
        　　∪￣∪
        """,
        """
        ┏┛┻━━━━━━┛┻┓
        ┃｜｜｜｜｜｜｜┃
        ┃　　　━　　　┃
        ┃　┳┛ 　┗┳ 　┃
        ┃┃
        ┃　　　┻　　　┃
        ┃┃
        ┗━┓　　　┏━┛
        　　┃　   　┃
        　　┃　   　┃
        　　┃　   　┃
        　　┃　　　┗━━━┓
        　　┃         ┣┓
        　　┃         ┃
        　　┗┓┓┏━┳┓┏┛
        　　　┃┫┫　┃┫┫
        　　　┗┻┛　┗┻┛
        """,
        """
        •.,¸,.•*`•.,¸¸,.•*¯ ╭━━━━╮
        •.,¸,.•*¯`•.,¸,.•*¯.|:::::::::: /___/
        •.,¸,.•*¯`•.,¸,.•* <|:::::::::(｡ ●ω●｡)
        •.,¸,.•¯•.,¸,.•╰ * >し------し---Ｊ
        """,
        """
              ∧_∧::
        　　 (´･ω･`)::
        　 /⌒　　⌒)::
        　/ へ_＿/ /::
         (＿＼＼ﾐ)/::
        　 ｜ `-イ::
        　 /ｙ　 )::
        　/／　／::
         ／　／::
        (　く:::
        |＼ ヽ:::
        
        """,
        """
              ＿＿＿
        　　 ／　　　▲
        ／￣　 ヽ　■■
        ●　　　　　■■
        ヽ＿＿＿　　■■
        　　　　）＝｜
        　　　／　｜｜
        　∩∩＿＿とﾉ
        　しし———┘
        """,
        """
         Δ~~~~Δ
        ξ •ェ• ξ
         ξ　~　ξ
         ξ　　 ξ
         ξ　　　“~～~～〇
         ξ　　　　　　 ξ
         ξ　ξ　ξ~～~ξ　ξ
         ξ_ξξ_ξ　ξ_ξξ_ξ
        """,
        """
        ｡　,∧ ＿ ∧　ﾟ。
        ・（ﾟ´Д｀ﾟ ）。
          （つ　　 ⊃
            　ヾ(⌒ﾉ
        　　  　` J
        """,
        """
        　　  ／ |
        　　 /　 ;
        　。|　　:
        　　|　　　'i,　 ૮₍ ⸝⸝´ ˘ `⸝⸝ ₎ა
        ☆　 'i　　　 ﾄ､_( ヽ∩∩ ) ___ ,　　.
        　.　　'i　　　　￣￣￣￣　　;'
        　　　　丶,　　　　　　　,／　　。ﾟ　☆
        　。ﾟ　　　　' ｰ- - - - '´´
        """,
        
    ]
    let komoji3Array = [
        
        """
                   ＿＿
        　　　　　🌸＞　　フ
        　　　　　| 　_　 _ l
        　 　　　／` ミ＿xノ
        　　 　 /　　　 　 |
        　　　 /　 ヽ　　 ﾉ
        　 　 │　　|　|　|
        　／￣|　　 |　|　|
        　| (￣ヽ＿_ヽ_)__)
        　＼二つ
        """,
        
        
        """
         /)   /)
        ( ᵔ ᵕ ᵔ )
          / づ  づ ~ ♡
        """,
        """
        ⠀  ⠀   (＼__/)
                   (•ㅅ•)      Don’t talk to
            ＿ノヽ ノ＼＿      me or my son
        `/　`/ ⌒Ｙ⌒ Ｙ  ヽ     ever again.
        ( 　(三ヽ人　 /　  |
        |　ﾉ⌒＼ ￣￣ヽ   ノ
        ヽ＿＿＿＞､＿_／
               ｜( 王 ﾉ〈   (＼__/)
               /ﾐ`ー―彡＼  (•ㅅ•)
              / ╰    ╯ ＼ /    ＼>
        """,
        """
         ╱|、
        (` -  7
         |、⁻＼
         じしˍ,)ノ
        """,
        """
            /)  /)
        ପ(˶•-•˶)ଓ ♡
           /づ  づ 𝕨𝕦𝕧 𝕦
        """,
        """
        ૮₍˶ᵔ ᵕ ᵔ˶₎ა
        ./づᡕᠵ᠊ᡃ່࡚ࠢ࠘ ⸝່ࠡࠣ᠊߯᠆ࠣ࠘ᡁࠣ࠘᠊᠊ࠢ࠘𐡏 💗
        ♡Pew pew♡
        """,
        """
        ・ ∧＿_(＿○￣) ∴ ・ ‌
        ∴ /　　　　ヽ_)∴ ．∴
        . 士 ＞　o ＜ 士 ♪　・
        　乂ﾞ＿＿＿ﾞメ・　∴・
        ∴ ⊂/　 ∞ 　(⊃・∴　∴
        ☆ （⌒)―(⌒)⠀
        """,
        """
           /ᐢ⑅ᐢ＼   ♡   ₊˚
        ꒰ ˶• ༝ •˶꒱       ♡‧₊˚    ♡
        ./づ~ :¨·.·¨:     ₊˚
                   `·..·‘    ₊˚   ♡
        """,
        """
        ・ ∧＿_(＿○￣) ∴ ・ ‌
        ∴ /　　　　ヽ_)∴ ．∴
        . 士 ＞　o ＜ 士 ♪　・
        　乂ﾞ＿＿＿ﾞメ・　∴・
        ∴ ⊂/　 ∞ 　(⊃・∴　∴
        ☆ （⌒)―(⌒)⠀
        """,
        """
                      (＼ __ /)
                      (˶˙Ⱉ˙˶)
               ＿ノ ヽ ノ＼＿
            /　`/ ⌒Ｙ⌒ Ｙ　 ＼
         ( 　(三ヽ人　 /　 　|
        |　ﾉ⌒＼ ￣￣ヽ　 ノ
        ヽ＿＿＿＞､＿＿／
                  ｜( 王 ﾉ〈
                   /ﾐ`ー―彡＼
                  |╰            ╯|
                  |       /＼       |
                  |      /  ＼      |
                  |    /     ＼     |
        """,
        """
                /＼_/＼
             ꒰ ˶• ༝ •˶꒱ ~🧋
        ┏━∪∪━━━━┓＼
                 柔らかい
        ┗━━━━━━━┛
        """,
        """
         ∧,,,∧   ~   ┏━━━━━━━━━━━━━━━━━━━━┓
        (  ̳• · • ̳)   ~ ♡  You’re purrfect   ♡
        /       づ  ~ ┗━━━━━━━━━━━━━━━━━━━━┛
        """,
        """
        •.,¸,.•*`•.,¸¸,.•*¯ ╭━━━━╮
        •.,¸,.•*¯`•.,¸,.•*¯.|:::::::::: /___/
        •.,¸,.•*¯`•.,¸,.•* <|:::::::::(｡ ●ω●｡)
        •.,¸,.•¯•.,¸,.•╰ * >し------し---Ｊ
        """,
        """
           
                    /＼__/＼
                 =( o  o   )=
                   /         ＼
                  /_|_|_(_-|====,
        """,
        """
          ♡ ∩∩
        （„• ֊ •„)♡<(muah!)
          </     ＼>
        """,
        """
        ૮₍  ˶•⤙•˶ ₎ა
        ./づ~ 🍓
        """,
        """
           /＼_/＼     (＼ __ /)      A__A
          ( ˶•o•˶)    ( •ω• )     ( •⤙•  )
        ଘ(ა🍱)    (ა🍙૮)｡  (🍜٩  )੭
        """,
        """
           /) /)
          ( • ༝•)
         c /づ  づ
        """,
        """
          ∧,,,∧
        (  ̳• · • ̳)
        /    づ♡ I love you
        """,
        
    ]
    
    
    let komoji4Array = [
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣤⣤⣤⣤⣤⣤⣤⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⠶⠟⠛⠛⠉⠉⠉⠁⠀⠀⠈⠉⠉⠙⠛⠿⢶⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⣠⠖⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⢠⡾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⣄⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀
            ⠀⠀⠀⣠⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣀⠀⠀⠀⠹⣧⡀⠀⠀⠀⡏⠉⠙⠋⢹⡆
            ⠀⠀⢠⡿⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠚⠉⠉⠛⠿⣦⡀⠀⠸⣷⡀⠀⠀⠹⣄⠀⠠⡹⠃
            ⠀⢀⣿⠃⠀⠀⠀⠀⣠⣶⠾⠟⠛⠉⠉⠛⠿⣶⣄⠀⠀⠀⠀⣰⠃⢀⣠⣤⣄⠀⠈⢻⣦⠀⢻⣧⠀⠀⠀⠈⠓⠋⠀⠀
            ⠀⢸⣿⠀⠀⠀⣠⣾⠋⠁⠀⠀⢀⣠⣤⣤⣤⣈⠙⣷⣄⠀⢠⣏⣶⣿⣿⣿⣿⣿⣦⠀⢻⣧⠘⣿⢀⢸⡛⠛⢲⠀⠀⠀
            ⠀⣾⡇⠀⠀⢠⡿⠁⠀⠀⣠⣾⡿⢿⣿⣿⣿⣿⣷⣌⢿⣆⢸⣿⡋⠉⢉⣿⣿⣿⣿⣧⠈⣿⠀⣿⣿⠀⠹⠶⠋⠀⠀⠀
            ⠈⡟⣿⠀⠀⢸⠇⠀⢀⣼⣄⠈⠀⣸⣿⣿⣿⣿⣿⣿⡎⣿⣿⣿⣿⣶⣿⣻⣿⣿⣿⣿⣤⣿⢀⣿⣿⠀⠀⠀⠀⠀⠀⠀
            ⠀⢷⢹⡆⠀⢸⡄⠀⣾⣿⣿⣿⣿⣿⣩⣿⣿⣿⣿⣿⣇⣿⢹⣿⣿⣿⣿⣿⣿⣿⣟⣿⣿⠏⣸⢧⠏⠀⠀⠀⠀⠀⠀⠀
            ⠀⠈⣇⢳⡀⠈⢧⠐⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⠏⢠⢁⡞⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠈⢎⠃⠀⠈⠳⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣾⠟⠁⠀⠀⠈⠻⣿⣿⣿⣿⡿⠟⠁⠀⣠⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠈⠳⣄⠀⠀⠈⠙⡻⠿⢿⣿⡿⠿⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠈⠉⠃⣀⡀⣰⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⣀⡤⠬⣷⣄⡲⣤⣈⠀⠈⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⡴⢛⡵⠚⠁⠀⢀⣠⣤⣀⡀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠸⣇⠀⠀⠀⢻⣿⠒⠭⣟⣷⢶⣤⣤⣤⣤⣤⣤⣤⣤⣶⢾⣟⠯⠗⠊⠁⠀⠀⠀⣾⠟⠁⠀⢘⣿⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⢹⣧⠀⠀⠈⣿⡄⠀⠀⠈⠉⠛⠛⠛⠛⠛⠒⠋⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⢸⡿⠀⠀⢠⣿⠏⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⣠⣿⠇⠀⠀⠙⠛⠛⠒⠒⠛⠛⠛⠻⠿⢷⡢⣤⣔⡶⠿⠟⠛⠛⠛⠻⠿⠽⠟⠁⠀⠀⢺⡿⡄⠀⠀⠀⠀⠀⠀
            ⠀⠀⢰⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣾⡁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⡀⠀⠀⠀⠀⠀
            ⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠻⢿⣿⠒⠲⠛⠙⠲⠦⢼⣿⡿⠟⠛⠃⠀⠀⠀⠀⠀⠀⠀⢸⣇⡇⠀⠀⠀⠀⠀
            ⠀⠀⠹⠿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠇⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡾⡻⠃⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠈⠻⢦⣀⠀⠀⠀⠀⠀⠀⢀⡾⡿⠀⠀⠀⠀⠀⠀⠘⣿⣆⠀⠀⠀⠀⠀⠀⢀⣠⣴⢯⠞⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠉⠛⠳⠶⠶⠶⣖⡿⠚⠁⠀⠀⠀⠀⠀⠀⠀⠘⠮⣷⣶⡤⡤⠴⠾⠟⠋⠚⠁⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣶⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣴⣶⣿⠟⠋⢹⣿⣇⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⣿⠿⠟⠛⠉⠁⢠⣤⣤⣿⡿⠛⠿⢿⣶⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⠟⠋⠀⠀⠀⠀⠀⠀⠈⠉⠛⠉⠀⠀⠀⠀⠀⠉⠻⢿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⢠⣿⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣄⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⢠⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⠿⠿⣶⡀⠀⠀⠀⣠⣤⣤⠀⠹⣿⡆⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⢠⣿⠏⠀⠀⠀⠀⠀⠀⢠⣶⣶⣦⠀⠀⠀⠀⢰⣿⠁⠀⢀⣿⡇⠀⠀⠀⢿⣿⣿⠇⠀⢻⣷⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⣾⡟⠀⠀⠀⠠⠔⠋⠀⠸⢿⣿⠟⠀⠀⠀⠀⠘⣿⡿⠿⢿⣿⠀⠀⠀⠀⠀⠉⠁⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀
            ⠀⠀⢀⣤⣷⣿⣿⣶⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣶⣾⡿⠀⠀⠀⠀⠀⠸⡆⠀⠀⢸⣿⣷⣶⣶⣄⠀⠀
            ⠀⢰⣿⠋⠁⠀⠀⠉⠛⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⡄⠀⢸⣿⡇⠀⠈⢻⣷⠀
            ⢀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣷⡀⠀⢀⣿⡇
            ⢸⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣷⢀⣾⡟⠀
            ⠀⣿⣿⣿⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⡿⠋⠀⠀
            ⠀⣿⡇⠉⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⡅⠀⠀⠀
            ⠀⢿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠃⠀⠀⠀
            ⠀⠘⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠀⠀⠀⠀
            ⠀⠀⠹⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⠃⠀⠀⠀⠀
            ⠀⠀⠀⠹⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⠃⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠈⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡿⠃⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠈⠻⣷⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠿⣷⣦⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣤⣴⣶⠿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⠿⠿⠿⠿⠿⠿⠿⠟⠛⠛⠉⠉⠀⠀⠉⠙⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠛⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⢇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠸⠀⠀⠀⣀⣠⡄⠀⠀⠀⠁⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣶⡶⠛⠛⠛⠟⢂⣶⣆⡀⠀⠇⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠆⠀⠀⠀⠀⠀⢀⣴⣿⠛⠛⢩⠇⠀⠀⠀⠀⠾⡇⠈⠻⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⢰⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⣠⠞⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠈⠀⠈⢷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠘⡄⡆⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⡉⠁⠀⣰⡟⣣⠶⠛⠙⢻⣦⠀⠀⠀⠀⠀⢀⣴⠶⠚⠳⣾⣿⡀⢠⠒⠲⡄⢀⣀⠀⠀⠇⢰⠀⠀
            ⠀⠀⠀⠀⠀⠀⠄⢡⠀⢠⡿⣿⠋⠀⠀⠀⠀⠹⣧⠀⠀⠀⠀⢸⠃⠀⠀⠀⠈⣿⣇⢸⡀⠀⠙⠉⠀⢹⠀⠰⠈⠀⠀
            ⠀⠀⠀⠀⠀⠀⢠⠀⠀⣼⣼⠇⠀⣰⣾⣶⠀⢀⣿⢂⣠⣄⣀⣼⡄⢰⣿⣶⡄⠸⣿⡀⢣⡀⠀⢀⣠⠎⠀⠒⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⡆⢠⣿⡿⠀⠀⢿⣿⠟⠀⢸⣿⡏⠁⠀⢙⣿⡇⠈⢿⣿⠇⠀⢻⣧⠀⠳⠖⠋⠀⠀⠀⠀⠀⠰⠀
            ⡴⠉⠉⠓⠒⠒⠤⣄⡸⣿⣧⠀⠀⠀⣤⡄⠀⠀⠙⠿⠿⠿⠿⠋⠁⠀⠀⣤⡀⠀⣸⣿⣀⡤⠔⠒⠚⠉⠉⠳⡀⠀⠃
            ⢧⠀⠀⠀⠀⠀⠀⠀⠉⣻⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⠋⠁⠀⠀⠀⠀⠀⠀⢰⠃⠀⠀
            ⠘⢆⠀⠀⠀⠀⠀⠀⠈⣟⠙⠛⠷⣦⣄⣀⡀⠀⠀⢀⣀⠴⣲⢤⣀⣀⣠⣴⠾⠻⣿⠀⠀⠀⠀⠀⠀⠀⢠⠏⠀⠀⠀
            ⠀⠈⢦⡀⠀⠀⠀⠀⠀⠈⢧⠀⠀⠈⠉⠋⠉⠉⠉⠉⠀⠀⠀⠀⣿⠉⠀⠀⠀⣸⢿⠀⠀⠀⠀⠀⠀⣠⠏⠀⠀⠀⠀
            ⠀⠀⠀⠳⣄⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠈⢧⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠈⠙⣲⠒⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⡒⠊⠉⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⢠⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣳⡀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⡀⠀⡴⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⡇⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⡜⢀⡇⠀⠀⠀⠀⢠⠴⢤⣠⠴⠶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠖⢻⣀⣀⣒⡇⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⡜⠀⠀⡇⠀⠀⠀⢠⠃⠀⡆⠀⠀⠀⠉⠉⣷⠀⠀⠀⠀⠀⠀⠀⢀⡎⠀⢀⠀⠀⠀⠿⣧⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⣧⠀⠀⠹⡄⠀⠀⢸⠀⠀⡇⠀⠀⠀⠀⢀⠇⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⢸⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠘⠳⠤⠤⣹⣦⡀⠸⡄⠀⠹⡄⠀⠀⠀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠸⡆⠀⠸⠀⢀⠼⠁⠀⢱⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠛⠦⣄⣁⣀⣤⠾⠓⠒⠉⠉⠀⠀⠀⠉⠉⠑⠛⠢⠤⠴⠋⠀⠀⠠⠘⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠆⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠠⠷⠀⠀⢀⣠⠴⢦
            ⢠⣶⡢⢤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠋⠀⠀⠀⣠⡶⠋⡴⢃⡟
            ⠈⢷⣉⠢⣘⣟⠲⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡄⠀⠀⡤⠃⢀⡴⠋⣱⡷⣫⣶⠏⠀
            ⠀⠀⢻⡉⠙⠛⢦⠈⠙⠦⣄⠀⠀⠀⡖⠶⢤⣤⡄⢀⣀⣀⣀⡀⠀⢀⣀⣤⡀⢀⡴⡿⠁⣰⠟⠋⡀⠃⠀⠀
            ⠀⠀⠀⠙⢶⡦⠤⣝⣦⣄⠘⡷⣄⡀⠃⣼⣿⣿⣷⣿⠏⠉⠉⠁⠀⠙⠉⢀⡷⠋⢸⢃⠜⢁⣠⡾⠁⠀⠀⠀
            ⠀⠀⠀⠀⠀⠙⠷⣄⡀⠈⠑⢷⡄⢹⠇⠀⠿⢿⣿⠋⠀⠀⠀⠀⠀⠀⠀⢸⠀⢠⡿⠛⠉⣴⠏⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠈⠻⣝⠒⠦⣝⣎⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠜⣣⣫⣴⣲⠟⠁⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢓⠒⠂⢿⠀⠀⠘⠻⠇⢀⣀⠰⠿⠋⠀⠀⢀⣯⣿⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣹⡟⠾⣧⡀⠀⠀⠀⠀⠉⠀⠀⠀⠀⣀⣞⣷⠿⠿⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠀⠀⣨⡧⠘⠿⠦⣤⠀⢰⠄⠐⠃⠈⢿⣍⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⢀⣠⣶⡅⠀⠀⠀⠀⠀⢠⠀⠀⠀⠀⠀⠠⣿⡒⠲⠤⣄⣀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠸⢂⣴⣞⣩⣼⣯⠀⠀⠀⠀⠀⠀⢘⡆⠀⠀⠀⠀⠀⠵⣌⣉⠛⢥⡭⠷⢦⡀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠰⣿⡾⠭⠿⣛⠁⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⢾⡉⠉⠉⠉⠉⠋⠁⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠠⣷⠆⠀⠲⠀⢠⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠁⠀⠛⢀⡄⢹⣇⠀⠀⠀⠀⢸⠀⠀⠀⢰⠀⠀⠀⢠⡄⠀⠈⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠲⡦⢀⣴⠒⠛⠋⠉⢠⣟⠀⠀⠀⠀⢀⠴⠀⠀⢸⡆⠀⠀⣸⡈⠀⣰⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⢸⡆⠀⠀⠀⠀⢼⣿⡆⠀⠀⠀⢸⣆⣀⡀⢸⡋⠀⠀⣿⡿⡦⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⢶⣄⠀⠀⠀⠀⠙⠛⠞⠛⠛⠛⠉⠉⠙⣿⣿⠂⠃⠙⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠰⠀⣠⡈⠈⡦⢶⡄⢀⣤⢀⠀⠀⠀⠀⠀⣀⣤⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠁⠈⠁⠀⠋⠘⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⠀⠀⠀⠀⠀⠀⢀⣠⠤⠔⠒⠒⠒⠒⠒⠢⠤⢤⣀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⢀⠴⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠲⣄⠀⠀⠀
            ⠀⠀⡰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀⠀
            ⠀⡸⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢇⠀
            ⠀⡇⠀⠀⠀⢀⡶⠛⣿⣷⡄⠀⠀⠀⣰⣿⠛⢿⣷⡄⠀⠀⠀⢸⠀
            ⠀⡇⠀⠀⠀⢸⣷⣶⣿⣿⡇⠀⠀⠀⢻⣿⣶⣿⣿⣿⠀⠀⠀⢸⠀
            ⠀⡇⠀⠀⠀⠈⠛⠻⠿⠟⠁⠀⠀⠀⠈⠛⠻⠿⠛⠁⠀⠀⠀⢸⠀
            ⠀⠹⣄⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠏⠀
            ⠀⠀⠈⠢⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣚⡁⠀⠀
            ⠀⠀⠀⠀⠈⠙⠒⢢⡤⠤⠤⠤⠤⠤⠖⠒⠒⠋⠉⠉⠀⠀⠉⠉⢦
            ⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸
            ⠀⠀⠀⠀⠀⠀⠀⢸⡀⠀⠀⠀⠀⣤⠀⠀⠀⢀⣀⣀⣀⠀⠀⠀⢸
            ⠀⠀⠀⠀⠀⠀⠀⠈⡇⠀⠀⠀⢠⣿⠀⠀⠀⢸⠀⠀⣿⠀⠀⠀⣸
            ⠀⠀⠀⠀⠀⠀⠀⠀⢱⠀⠀⠀⢸⠘⡆⠀⠀⢸⣀⡰⠋⣆⠀⣠⠇
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⠤⠤⠼⠀⠘⠤⠴⠃⠀⠀⠀⠈⠉⠁⠀@swtkiss_ (ig)
            """,
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⢤⠤⢄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣻⠟⠛⠛⠳⣯⡓⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⡿⠋⠀⠀⠀⠀⠀⠻⣮⢳⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⣀⢴⣿⣭⣭⣟⠶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⡿⠁⠀⠀⠀⠀⡀⠀⠀⠘⢷⡹⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⣰⣻⠟⠁⠀⠀⠈⠻⢦⡑⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣞⡾⠁⠀⠀⠀⠀⢠⡿⠀⠠⠀⠈⢷⡹⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⣸⣳⠏⠀⠀⠀⠀⠀⠀⠈⠹⣦⡓⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣞⣾⠁⠀⠀⠀⠀⢀⣿⠃⢀⠁⠠⡀⠈⣷⣹⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⢠⣯⡟⠀⠀⠀⣤⠀⠀⠀⠀⠀⠈⠻⣮⡣⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡜⣼⠃⠀⠀⠀⠀⠀⣼⡟⢀⠠⠐⠀⢡⠀⠘⣷⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⣼⣿⠃⠀⣴⠀⠹⣷⡀⠀⠀⠀⠀⠀⠈⢷⣜⢦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⠏⠀⠀⠀⠀⠀⢰⣿⠀⠄⠂⠐⡈⠀⢃⠀⢹⣎⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⡟⣿⠀⠀⠏⠀⡀⠻⣷⡀⠀⠀⠀⠀⠀⠈⢻⣌⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣏⡿⠀⠀⠀⠀⠀⠀⣸⡟⠀⠰⠀⠂⠡⢀⠸⡀⠈⣿⢿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣟⡏⠀⣠⠂⠐⠀⡀⠙⣿⡄⠀⠀⠀⠀⠀⠀⠙⣧⡳⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⠃⠀⠀⠀⠀⠀⠀⣿⠇⡂⠁⠄⡁⠐⠠⠀⢡⠀⠸⣏⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⡇⠀⣟⠀⠠⠁⠀⠄⡈⢿⣆⠐⠀⠀⠀⠀⠀⠈⢿⡜⢦⣀⣤⢴⣖⣶⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⣿⠀⡇⠈⡐⠀⠌⠐⠠⠘⡆⠀⢿⣼⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⡇⠀⡯⠀⢂⠠⠁⠠⠀⠌⢿⣆⠀⠀⠀⠀⠀⠀⣀⣿⣾⡿⠛⠋⠉⠉⢹⡄⠀⢠⡿⠀⠀⠀⠀⠀⠀⠀⠀⣿⡄⣠⣐⡀⠁⠌⠠⢁⠀⢣⠀⠸⣏⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⡇⠀⢃⠐⠀⠄⠠⠁⡐⠈⡈⣿⡆⠀⠀⢀⣴⠿⠛⠉⢸⡇⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⢟⠛⢻⡧⠐⠈⡐⠠⢀⠂⠆⠀⣿⣽⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⡇⠀⠀⠂⢈⠀⢂⠐⠀⢂⠐⢸⣧⠀⠀⠀⠀⠀⠐⠀⢸⡁⠀⠀⠀⠀⠈⡗⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣧⣴⣤⡀⠂⢂⠀⡃⠀⢸⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠘⣿⡇⠀⠀⠡⠀⠂⠄⠂⢡⣾⠿⠿⠿⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⣟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠋⠉⠉⣿⡇⠀⠡⠀⢸⠀⠈⣧⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⡿⣿⠀⠠⠁⠐⠠⠐⠠⡘⢿⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣇⠀⠀⠀⠀⠀⢻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⡟⠀⢈⠐⠠⠈⠀⠀⣿⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⣿⣿⠀⠀⡃⢀⠂⠀⣿⡿⠛⠿⠶⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡀⠀⠀⠀⠀⠘⣧⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠈⢷⡀⢀⠈⠄⠐⡀⠀⢼⡾⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⢿⣿⡇⠀⡇⠀⡀⠂⢹⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⡇⠀⠀⠀⠀⠀⠈⠳⣄⡀⠀⢀⣾⣿⣿⣿⣦⡀⠀⠀⠀⠀⠀⠈⢿⡄⠢⠐⠠⠀⠀⢸⡇⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⢸⣿⣧⠀⠰⠀⠠⠐⠀⠹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠟⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠶⣾⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠘⢿⣄⠂⠐⠀⠀⣼⢧⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠈⣿⣿⠀⠘⠄⠐⠀⠌⢠⡿⠀⠀⠀⠀⣀⣤⣦⣶⣤⣴⠏⠀⣀⣤⣴⣶⣶⣶⣦⣤⡀⠀⠀⠙⢿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠜⣿⡀⠈⠀⢠⣿⣿⠁⢀⡀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠸⣿⣇⠀⠻⡀⠈⠀⣿⠃⠀⠀⢠⣾⣿⣿⡿⢿⣿⠏⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠉⢿⡛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠐⠘⣿⣀⣴⣿⣿⣿⣿⣿⣭⣟⢦⣀⣀⣀⠀⠀
            ⠀⠀⠀⢻⣻⣆⠀⠱⣀⢩⣿⠀⠀⠀⠠⠟⠋⠁⠀⣰⠃⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⡟⠙⣿⣿⠁⠀⢹⣿⡿⠿⣯⡻⡆
            ⠀⠀⠀⠈⢻⣻⣦⠀⠉⢸⡗⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⠀⠀⠈⠛⠿⣿⣿⣿⠿⠛⠉⠀⠀⠀⠀⣀⠀⠀⠈⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⡶⠀⣿⣿⡀⠐⠈⢁⠠⠀⣼⣇⡇
            ⠀⠀⠀⠀⠀⠙⢽⡷⣦⣽⡇⠀⠀⠀⠀⠀⠀⠀⢰⡇⢀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠸⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⢿⣝⣿⡼⣿⣧⡐⠈⣠⣤⢾⣫⠟⠁
            ⠀⠀⠀⠀⠀⠀⠀⠙⢻⣿⠇⠀⠀⠀⠀⠀⠀⠀⢸⠇⠘⣧⠀⠀⠀⠀⠀⢀⣾⣧⣄⣀⢀⣀⣠⣾⠋⠀⠀⠀⠀⠙⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣻⡇⠀⠘⢿⣿⣛⡿⠷⠋⠁⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⡾⣿⠀⠀⠀⠀⠀⠀⠀⢠⡟⠀⠀⠈⠳⣶⣤⡴⣾⢿⡹⢮⡝⣯⢻⣽⣿⣿⣄⠀⠀⠀⠀⠀⠀⠉⠓⠦⣤⣄⣀⣀⣠⣤⠿⢻⡞⣷⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⢀⣾⣷⣿⠀⠀⠀⠀⠀⣀⡴⠋⠀⠀⠀⠀⠀⠹⣷⡹⣎⢷⡹⢧⣻⣼⠿⣿⣄⠉⠙⢷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⢻⣽⣧⣤⣀⣀⣠⡴⠞⠋⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⣯⣞⣭⣻⣟⣷⡀⢀⠛⢿⡄⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣶⣶⣶⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠈⢿⣿⡿⠛⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⠛⠛⠻⣧⡈⠐⢈⣡⣾⠏⠀⠀⠀⠀⠀⠀⠀⣀⣤⣶⣯⠿⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠘⢿⣓⣶⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠛⠋⠁⠀⠀⠀⠀⠀⠀⠶⠛⠉⢸⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠻⣿⣺⣿⣿⣻⢦⣤⣤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⢿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⢿⣿⣧⠀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡿⣾⠹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⠛⣯⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣷⡿⠀⠘⠻⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠟⠁⠀⢿⣸⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⡇⠀⠀⠖⠀⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⢶⠀⠀⢸⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠙⠒⠒⠒⠖⠶⠦⠤⠤⢤⡤⣤⠤⣤⢤⡤⣤⢤⡤⠤⠤⠤⠴⠶⠒⠒⠒⠒⠊⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⣿⣷⣤⣿⣤⣨⣿⡀⠀⠀⠉⠙⠷⣤⠀⠈⢻⡇
            ⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⠴⠚⠋⠉⠉⠉⠉⠉⠛⠒⠦⣤⡀⠀⠈⢻⣆⠀⠹
            ⠀⠀⠀⣴⢶⣶⡶⠖⢋⡽⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠓⠶⣾⣿⣠⡤
            ⠀⠀⠀⣻⠦⢀⣠⣴⡿⠁⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣄⠀
            ⠀⠀⠉⠀⢰⣿⣿⣿⣇⠀⢀⣴⡟⠀⠀⠀⠀⠀⠀⠀⣸⠀⠀⠀⠀⠀⠀⠀⠘⣷
            ⢧⣀⠀⠀⢸⣿⡿⠟⢋⣴⠋⣸⠁⠀⠀⠀⠀⠀⠀⣴⢻⡶⡄⠀⠀⠀⠀⠀⠀⠘
            ⠀⢨⠃⠀⡿⠋⢀⡴⠋⠀⢀⡟⠀⡀⠀⠀⠀⣹⣾⣅⠈⣇⡇⠀⠀⠀⠀⠀⠀⠀
            ⣾⠃⠀⠀⠀⣰⠏⣀⡀⠀⢸⢷⡾⠁⣀⣤⠾⠋⠀⠀⠀⢹⣇⠀⠀⠀⠀⠁⠀⠀
            ⡇⠀⠀⠀⣰⠏⣾⣿⣿⠀⠀⠘⠓⠛⠉⠁⢀⣴⣶⣄⠀⠀⣿⡄⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⣠⡟⠀⠙⠛⠋⠀⠀⠀⠀⠀⢀⠀⠺⣿⣿⡿⠂⠀⡟⠁⠀⠀⠀⠀⢠⠀
            ⠀⠀⠀⣿⠁⠀⠀⠀⠀⠸⠶⠶⡶⣾⠋⠀⠀⠈⠉⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⡄
            ⠀⠀⠀⢹⣦⡀⠀⠀⠀⠀⠀⠀⠀⢿⡄⠀⠀⠀⠀⠀⠀⢰⡇⠀⠀⠀⠀⠀⠀⡇
            ⠀⠀⠀⢸⣍⣻⣶⣤⣤⣤⣤⣤⣀⣀⣀⡀⠀⠀⠀⠀⠀⣾⠁⠀⠀⠀⠀⠀⠀⡇
            ⠀⢰⡄⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣷⣶⣿⠏⠀⠀⠀⠀⠀⠀⢠⡇
            ⠀⠈⢿⣷⣦⣿⣿⣿⣿⣿⣿⣿⠟⠙⠿⠋⠈⢿⣿⣿⠏⠀⠀⠀⠀⠀⠀⢀⡞⠀
            """,
            """
            ⢀⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⢸⣿⣿⣙⣷⡄⠀⠀⠀⠀⠀⠀⢀⣀⠀⣴⣦⡀⠀⠀⣠⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠘⣿⣿⣿⡟⢿⡀⠀⠀⠀⠀⠀⠻⢿⣷⡍⠙⠃⠀⠾⢿⠟⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠹⣿⣯⣿⣿⡇⠀⠀⢀⣤⣶⠾⠿⠈⠁⠀⠀⠀⠀⠻⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠘⢿⣿⣟⣿⢀⣶⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣦⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠛⢿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣶⣶⣤⣀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣧⣼⣿⣿⢿⣿⣦⡀⠀⠀
            ⠀⠀⠀⠀⠀⣼⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡟⢿⣿⣿⠿⣟⣻⣷⣄⠀
            ⠀⠀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣻⡇⠀⠉⠻⢷⣿⣿⣽⣿⣦
            ⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡇⠀⠀⠀⠀⠈⠙⠛⠿⠿
            ⠀⠀⠀⠀⠀⢿⡇⠀⠀⠀⠀⣠⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⡀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⢀⣾⠟⠀⠀⠀⠀⣿⡿⠀⠀⠀⢀⣀⣀⠀⠀⠀⢸⣿⠇⠀⠀⠈⢻⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⠿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠘⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠈⠻⣷⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⣴⡾⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠛⠻⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⠛⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            """,
            """
            ⣶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⣿⣿⣷⣦⠀⠀
            ⣿⣿⣿⣿⣿⣗⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⡿⠛⣝⣿⣿⡷⡀⠀
            ⣿⡟⠁⡉⠙⠻⣿⣿⣦⣤⣤⣶⣶⣶⣶⣶⣾⣿⣿⡿⠋⠀⠌⡐⠈⣿⣿⣧⠀⠀
            ⣿⠀⢂⠐⡁⢂⣬⣿⣿⣿⠟⠋⠀⠀⠀⠀⠉⠿⣿⣿⣿⣿⣶⣶⣤⣈⣿⣿⣗⠀
            ⡇⢀⣦⣼⣾⣿⣿⣿⡿⡃⠌⠀⠀⠀⠀⠀⠀⠀⠑⡹⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀
            ⣿⣿⣿⣿⣿⣿⣟⢯⢃⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠉⢎⠳⣯⣟⣿⣿⣿⣿⣷
            ⣿⣿⣿⣿⡿⡓⢎⠂⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⣰⣬⣧⡝⢊⢹⣿
            ⣿⣯⠟⠥⠃⢉⠀⣴⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⠀⠸⣻
            ⡏⠄⡈⠤⣁⠢⡀⢿⣿⣿⣿⠇⠀⠀⠀⠀⣤⡄⠀⣶⠀⠀⡙⢛⢛⡛⠭⢸⣿⣿
            ⠐⡠⢑⡒⡄⠓⡌⣌⢩⣩⠷⠶⣤⠀⠀⠀⠻⣷⡾⠃⢀⢸⡼⠋⠛⢿⣦⣻⣿⡧
            ⢀⠱⡈⢖⡈⢣⠜⣠⡟⠁⠀⠀⠀⢳⡄⠀⠀⠀⠀⠀⠐⣾⠃⠀⠀⠀⠈⢿⣯⣿
            ⣦⠠⢑⠢⣉⠆⢼⡟⠀⠀⠀⠀⠀⢸⣷⠀⠀⠀⠀⠀⣸⡇⠀⠀⠀⠀⠀⠈⣿⣿
            ⡟⠀⠀⢁⠂⣼⡟⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⣾⣷⠀⠀⠀⠀⠀⠀⠈⢿
            ⠀⠀⠀⠀⣴⠏⠀⠀⠀⠀⠀⠀⠀⢠⣿⠀⠀⠀⠀⠀⢸⣿⡅⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⢠⣾⡇⠀⠀⠀⠀⠀⠀⢿⣷⠀⠀⠀⠀⠀⠀⠀
            """,
    ]
}
extension KIkbsDataManager {
    func loadJson<T: Codable>(_: T.Type, name: String, type: String = "json") -> T? {
        if let path = Bundle.main.path(forResource: name, ofType: type) {
            do {
                let data = try Data(contentsOf: URL(fileURLWithPath: path))
                return try! JSONDecoder().decode(T.self, from: data)
            } catch let error as NSError {
                debugPrint(error)
            }
        }
        return nil
    }
    
    func loadJson<T: Codable>(_:T.Type, path:String) -> T? {
        do {
            let data = try Data(contentsOf: URL(fileURLWithPath: path))
            do {
                return try PropertyListDecoder().decode(T.self, from: data)
            } catch let error as NSError {
                print(error)
            }
        } catch let error as NSError {
            print(error)
        }
        return nil
    }
    
    func loadPlist<T: Codable>(_:T.Type, name:String, type:String = "plist") -> T? {
        if let path = Bundle.main.path(forResource: name, ofType: type) {
            return loadJson(T.self, path: path)
        }
        return nil
    }
    
}
